{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_23","layers":[{"class_name":"Dense","config":{"units":8,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense45","trainable":true,"batch_input_shape":[null,6],"dtype":"float32"}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense46","trainable":true}}]},"keras_version":"tfjs-layers 3.7.0","backend":"tensor_flow.js"},"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.7.0","convertedBy":null,"weightsManifest":[{"paths":["./my-model.weights.bin"],"weights":[{"name":"dense_Dense45/kernel","shape":[6,8],"dtype":"float32"},{"name":"dense_Dense45/bias","shape":[8],"dtype":"float32"},{"name":"dense_Dense46/kernel","shape":[8,2],"dtype":"float32"},{"name":"dense_Dense46/bias","shape":[2],"dtype":"float32"}]}]}